app/controllers/api/v1/resources_controller.rb

      def index
        Rails.logger.info "params.inspect"
        if params[:tagged]
          @resources = Resource.tagged?
        else
          @resources = Resource.all
---
SELECT "resources".* FROM "resources"